#### Terraform Format and Style 🖌

<details><summary>Show Formatted Files</summary>

```

es.tf
ham_query.tf

```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖 
Warning: Argument is deprecated

  with aws_s3_bucket.history,
  on cdn.tf line 718, in resource "aws_s3_bucket" "history":
 718: resource "aws_s3_bucket" "history" {

Use the aws_s3_bucket_cors_configuration resource instead

(and 6 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.

 
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_sns_topic.ham_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem]
aws_ecr_repository.tawhiri_downloader: Refreshing state... [id=tawhiri-downloader]
aws_vpc.main: Refreshing state... [id=vpc-0a0baa77]
aws_iam_role.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5]
aws_acm_certificate.CertificateManagerCertificate_root: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/a7da821c-bdbc-404b-aa12-bce28d86cdeb]
aws_iam_role.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole]
aws_ecs_cluster.ws: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/ws]
aws_iam_role.historic: Refreshing state... [id=historic]
aws_iam_role.IAMRole3: Refreshing state... [id=CognitoAccessForAmazonES]
aws_s3_bucket.cf_logs: Refreshing state... [id=sondehub-cloudfront-logs]
aws_s3_bucket.predict: Refreshing state... [id=sondehub-predict]
aws_route53_zone.Route53HostedZone: Refreshing state... [id=Z0571575V2EX2P3LK16U]
aws_sqs_queue.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_ecs_cluster.aprsgw: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/aprsgw]
aws_ecs_cluster.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/Tawhiri]
aws_cloudwatch_event_rule.history: Refreshing state... [id=history_queue]
aws_s3_bucket.card: Refreshing state... [id=sondehub-v2-card]
aws_ecr_repository.wsproxy: Refreshing state... [id=wsproxy]
aws_cloudwatch_event_rule.ham_predict_updater: Refreshing state... [id=ham_predict_updater]
aws_s3_bucket.lambda_functions: Refreshing state... [id=terraform-20211220081940015700000001]
aws_iam_role.ws: Refreshing state... [id=ws]
aws_iam_role.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_cognito_user_pool.CognitoUserPool: Refreshing state... [id=us-east-1_G4H7NMniM]
aws_efs_file_system.tawhiri: Refreshing state... [id=fs-519cd0e5]
aws_s3_bucket.history: Refreshing state... [id=sondehub-history]
aws_iam_service_linked_role.IAMServiceLinkedRole: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/es.amazonaws.com/AWSServiceRoleForAmazonElasticsearchService]
aws_sqs_queue.historic_to_s3_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/update-history-dlq]
aws_iam_role.sign_socket: Refreshing state... [id=sign_socket]
aws_ecr_repository.tawhiri: Refreshing state... [id=tawhiri]
aws_sqs_queue.ham_sqs_to_elk_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk-dlq]
aws_iam_role.ham_predict_updater: Refreshing state... [id=ham-predict-updater]
aws_iam_role.history: Refreshing state... [id=history]
aws_acm_certificate.CertificateManagerCertificate: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/e2187cc3-6098-4ac9-917e-acd414bdb75e]
aws_iam_role.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092010702200000001]
aws_iam_service_linked_role.IAMServiceLinkedRole3: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/ops.apigateway.amazonaws.com/AWSServiceRoleForAPIGateway]
aws_cloudwatch_event_rule.predict_updater: Refreshing state... [id=predict_updater]
aws_iam_role.recovered: Refreshing state... [id=recovered]
aws_ecs_task_definition.ws: Refreshing state... [id=ws]
aws_apigatewayv2_api.main: Refreshing state... [id=r03szwwq41]
aws_cloudwatch_event_rule.recovery_ingest: Refreshing state... [id=recovery_ingest]
aws_appautoscaling_target.tawhiri: Refreshing state... [id=service/Tawhiri/tawhiri]
aws_iam_role.aprsgw: Refreshing state... [id=aprsgw]
aws_appautoscaling_target.ws_reader: Refreshing state... [id=service/ws/ws-reader]
aws_iam_role.predict_updater: Refreshing state... [id=predict-updater]
aws_sns_topic.sonde_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem]
aws_iam_role.ham_sqs_to_elk: Refreshing state... [id=ham_sqs-to-elk]
aws_s3_bucket.v2: Refreshing state... [id=v2.sondehub.org]
aws_ecs_task_definition.aprsgw: Refreshing state... [id=aprsgw]
aws_security_group.lb: Refreshing state... [id=sg-0425f0e462f849164]
aws_subnet.private["us-east-1b"]: Refreshing state... [id=subnet-0896109fa272ce2a5]
aws_subnet.ws_main: Refreshing state... [id=subnet-062e92591b41338d6]
aws_subnet.private["us-east-1c"]: Refreshing state... [id=subnet-07308ab971680b901]
aws_subnet.private["us-east-1d"]: Refreshing state... [id=subnet-03512eaff0c9442b3]
aws_subnet.private["us-east-1e"]: Refreshing state... [id=subnet-034d5414804d2675f]
aws_subnet.private["us-east-1f"]: Refreshing state... [id=subnet-0da5e895f93b6f106]
aws_subnet.private["us-east-1a"]: Refreshing state... [id=subnet-0a3559e6c60534d32]
aws_lb_target_group.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws/deda6fb24618e1bd]
aws_security_group.tawhiri_efs: Refreshing state... [id=sg-0c02c0854e5376885]
aws_internet_gateway.gw: Refreshing state... [id=igw-b5988cce]
aws_lb_target_group.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/tawhiri/eef603500a548185]
aws_security_group.ws_writer: Refreshing state... [id=sg-09a8e16a347be7a57]
aws_security_group.tawhiri_alb: Refreshing state... [id=sg-009775f4b64627830]
aws_egress_only_internet_gateway.main: Refreshing state... [id=eigw-07166246a33f04b24]
aws_subnet.public["us-east-1c"]: Refreshing state... [id=subnet-408d1c1f]
aws_lb_target_group.ws_reader: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws-reader/505318ab8a79f70b]
aws_subnet.public["us-east-1d"]: Refreshing state... [id=subnet-a7f460c1]
aws_subnet.public["us-east-1e"]: Refreshing state... [id=subnet-5c34ec6d]
aws_subnet.public["us-east-1f"]: Refreshing state... [id=subnet-204b052e]
aws_subnet.public["us-east-1a"]: Refreshing state... [id=subnet-de4ddeff]
aws_subnet.public["us-east-1b"]: Refreshing state... [id=subnet-7b1c3836]
aws_route_table.main: Refreshing state... [id=rtb-0efda81da4e7baf2b]
aws_route53_record.ws_reader_CNAME: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws-reader_CNAME]
aws_iam_role_policy.efs: Refreshing state... [id=ecsTaskExecutionRole:EFS]
aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole-20211026015558575000000001]
aws_iam_role_policy.kms: Refreshing state... [id=ecsTaskExecutionRole:kms]
aws_iam_role_policy.ssm: Refreshing state... [id=ecsTaskExecutionRole:SSM]
aws_cloudfront_distribution.predict: Refreshing state... [id=E258SM01Q3NTFC]
aws_sqs_queue.historic_to_s3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/update-history]
aws_cognito_user_pool_client.CognitoUserPoolClient: Refreshing state... [id=227g2bbcb2tqjfii1ipt2tj5m6]
aws_iam_role_policy.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5:iot]
aws_iam_role_policy.historic: Refreshing state... [id=historic:historic]
aws_ecs_task_definition.tawhiri_ruaumoko: Refreshing state... [id=tawhiri-ruaumoko]
aws_ecs_task_definition.tawhiri: Refreshing state... [id=tawhiri]
aws_ecs_task_definition.ws_reader: Refreshing state... [id=ws-reader]
aws_ecs_task_definition.ws_reader_ec2: Refreshing state... [id=ws_reader_ec2]
aws_sqs_queue.ham_sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk]
aws_iam_role_policy_attachment.ws: Refreshing state... [id=ws-20211026015558574900000002]
aws_iam_role_policy.s3_config: Refreshing state... [id=ws:s3-config]
aws_iam_role_policy.sqs_to_elk: Refreshing state... [id=sqs-to-elk:sqs_to_elk]
aws_s3_bucket_object.lambda: Refreshing state... [id=lambda.zip]
aws_cloudfront_distribution.card: Refreshing state... [id=E1U5IIXI87Q160]
aws_route53_record.cert_validation["*.v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_route53_record.cert_validation["v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_appautoscaling_policy.tawhiri: Refreshing state... [id=cpu]
aws_iam_role_policy.ham_predict_updater: Refreshing state... [id=ham-predict-updater:ham_predict_updater]
aws_iam_role_policy.history: Refreshing state... [id=history:terraform-20210215030637833400000001]
aws_appautoscaling_policy.ws_reader: Refreshing state... [id=ws-reader-tt]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_sqs_queue_policy.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_sns_topic_subscription.sqs_to_elk: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem:1a52ac41-6e17-43da-bfb6-114577c94ca6]
aws_iam_role_policy.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092010702200000001:terraform-20211129092014982100000002]
aws_s3_bucket_policy.S3BucketPolicy2: Refreshing state... [id=sondehub-history]
aws_iam_role_policy.recovered: Refreshing state... [id=recovered:recovered]
aws_network_interface.ws_pad[0]: Refreshing state... [id=eni-0da878f06d90dcde9]
aws_network_interface.ws_pad[3]: Refreshing state... [id=eni-0d40407d608d35e38]
aws_network_interface.ws_pad[8]: Refreshing state... [id=eni-07c92d00c031482ec]
aws_network_interface.ws_pad[1]: Refreshing state... [id=eni-0d808bd7acad70c66]
aws_network_interface.ws_pad[5]: Refreshing state... [id=eni-0776494ae4f908042]
aws_network_interface.ws_pad[6]: Refreshing state... [id=eni-069ebf56c9e4fdd7f]
aws_network_interface.ws_pad[2]: Refreshing state... [id=eni-0ddc45ce32abb4a58]
aws_network_interface.ws_pad[4]: Refreshing state... [id=eni-01e4afb86960a27cf]
aws_network_interface.ws_pad[7]: Refreshing state... [id=eni-054a9210306259e1b]
aws_iam_role_policy_attachment.aprsgw: Refreshing state... [id=aprsgw-20220112094238495800000001]
aws_iam_role_policy.aprsgw: Refreshing state... [id=aprsgw:aprsgw]
aws_iam_role_policy.predict_updater: Refreshing state... [id=predict-updater:predict_updater]
aws_security_group_rule.ws_writer_lb: Refreshing state... [id=sgrule-71149243]
aws_security_group.ws_reader: Refreshing state... [id=sg-05f795128b295c504]
aws_security_group_rule.ws_writer_lightsail_lb: Refreshing state... [id=sgrule-3510979606]
aws_security_group.tawhiri: Refreshing state... [id=sg-006470b1ebfd4a08c]
aws_iam_role_policy.ham_sqs_to_elk: Refreshing state... [id=ham_sqs-to-elk:ham_sqs_to_elk]
aws_route_table_association.private["us-east-1c"]: Refreshing state... [id=rtbassoc-05bf1c64dde7d3001]
aws_route_table_association.private["us-east-1f"]: Refreshing state... [id=rtbassoc-0f9985420e6d42686]
aws_route_table_association.private["us-east-1d"]: Refreshing state... [id=rtbassoc-0f6ddbb66ac06b1fb]
aws_route_table_association.private["us-east-1e"]: Refreshing state... [id=rtbassoc-07e1e368e5fb6fbcd]
aws_route_table_association.private["us-east-1a"]: Refreshing state... [id=rtbassoc-0c03b064cbe58bb27]
aws_route.main6: Refreshing state... [id=r-rtb-0efda81da4e7baf2b2750132062]
aws_route_table_association.private["us-east-1b"]: Refreshing state... [id=rtbassoc-0c0159705bf0df21a]
aws_route.main: Refreshing state... [id=r-rtb-0efda81da4e7baf2b1080289494]
aws_route_table_association.ws_main: Refreshing state... [id=rtbassoc-021c8735f65874b12]
aws_route_table_association.public["us-east-1c"]: Refreshing state... [id=rtbassoc-04f6b072cd2757eb1]
aws_route_table_association.public["us-east-1a"]: Refreshing state... [id=rtbassoc-076de61e98b8d24c6]
aws_route_table_association.public["us-east-1b"]: Refreshing state... [id=rtbassoc-058a38abf9f2db008]
aws_route_table_association.public["us-east-1e"]: Refreshing state... [id=rtbassoc-0f7a085597490861b]
aws_route_table_association.public["us-east-1d"]: Refreshing state... [id=rtbassoc-0876fcc853d907d22]
aws_route_table_association.public["us-east-1f"]: Refreshing state... [id=rtbassoc-08ea26e46a3175313]
aws_ecs_service.aprsgw: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/aprsgw/aprsgw]
aws_lb.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:loadbalancer/app/ws/d29968044c69f0da]
aws_s3_bucket_policy.S3BucketPolicy: Refreshing state... [id=v2.sondehub.org]
aws_cloudfront_distribution.amateur: Refreshing state... [id=E1ILNS33XUZJZO]
aws_ecs_service.ws_writer: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-writer]
aws_sns_topic_subscription.ham_sqs_to_elk: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem:ed623df4-92e4-44dd-8048-66a406abf7b8]
aws_cognito_identity_pool.CognitoIdentityPool: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_sqs_queue_policy.ham_sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk]
aws_ecs_service.ws_reader_ec2: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-reader-ec2]
aws_lambda_function.get_sondes: Refreshing state... [id=query]
aws_lambda_function.ham_sns_to_mqtt: Refreshing state... [id=ham-sns-to-mqtt]
aws_lambda_function.ham_upload_telem: Refreshing state... [id=ham-put-api]
aws_lambda_function.ham_predictions: Refreshing state... [id=ham_predictions]
aws_lambda_function.get_telem: Refreshing state... [id=get_telem]
aws_lambda_function.predictor_update_trigger_lambda: Refreshing state... [id=tawhiri-updater]
aws_lambda_function.ham_telem: Refreshing state... [id=ham_get_telem]
aws_lambda_function.history: Refreshing state... [id=history]
aws_lambda_function.sign_socket: Refreshing state... [id=sign-websocket]
aws_lambda_function.get_listener_telemetry: Refreshing state... [id=get_listener_telemetry]
aws_lambda_function.get_sites: Refreshing state... [id=get_sites]
aws_lambda_function.recovery_ingest: Refreshing state... [id=recovery_ingest]
aws_lambda_function.upload_telem: Refreshing state... [id=sonde-api-to-iot-core]
aws_lambda_function.reverse_predictions: Refreshing state... [id=reverse-predictions]
aws_lambda_function.ham_get_listener_telemetry: Refreshing state... [id=ham_get_listener_telemetry]
aws_lambda_function.predictions: Refreshing state... [id=predictions]
aws_lambda_function.station: Refreshing state... [id=station-api-to-iot-core]
aws_lambda_function.sns_to_mqtt: Refreshing state... [id=sns-to-mqtt]
aws_lambda_function.ham_get: Refreshing state... [id=ham_get]
aws_lambda_function.ham_listener_put: Refreshing state... [id=ham-listener-put]
aws_lambda_function.redirect: Refreshing state... [id=sondehub-redirect]
aws_lambda_function.get_listener_stats: Refreshing state... [id=get_listener_stats]
aws_route53_record.predict_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_AAAA]
aws_security_group_rule.ws_writer_reader: Refreshing state... [id=sgrule-4271061801]
aws_route53_record.predict_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_A]
aws_ecs_service.ws_reader: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-reader]
aws_ecs_service.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/Tawhiri/tawhiri]
aws_acm_certificate_validation.CertificateManagerCertificate: Refreshing state... [id=2021-12-30 06:13:39.758 +0000 UTC]
aws_route53_record.amateur_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_amateur_AAAA]
aws_route53_record.ham_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_ham_AAAA]
aws_route53_record.ham_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_ham_A]
aws_route53_record.amateur_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_amateur_A]
aws_route53_record.tawhiri_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_AAAA]
aws_route53_record.tawhiri_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_A]
aws_route53_record.ws_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_A]
aws_route53_record.ws_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_AAAA]
aws_elasticsearch_domain.ElasticsearchDomain: Refreshing state... [id=arn:aws:es:us-east-1:143841941773:domain/sondes-v2-7-9]
aws_iam_role.unauth_role: Refreshing state... [id=Cognito_sondesUnauth_Role]
aws_iam_role.auth_role: Refreshing state... [id=Cognito_sondesAuth_Role]
aws_sns_topic_subscription.predictor_update_trigger_lambda: Refreshing state... [id=arn:aws:sns:us-east-1:123901341784:NewGFSObject:5a9698ec-7a1a-4689-867b-383db19e457a]
aws_lambda_permission.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092033043900000003]
aws_lambda_permission.ham_predictions: Refreshing state... [id=terraform-20220409020828193200000001]
aws_apigatewayv2_integration.ham_predictions: Refreshing state... [id=v0bac0g]
aws_lambda_permission.sign_socket: Refreshing state... [id=terraform-20210201060604212000000001]
aws_apigatewayv2_integration.sign_socket: Refreshing state... [id=3z0z19e]
aws_lambda_permission.ham_telem: Refreshing state... [id=terraform-20220226234645796200000002]
aws_apigatewayv2_integration.ham_telem: Refreshing state... [id=qxaxvaq]
aws_sns_topic_subscription.ham_sns_to_mqtt: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem:c3cdaafd-a2de-43d8-b699-bee70c267479]
aws_lambda_permission.ham_sns_to_mqtt: Refreshing state... [id=terraform-20220116225823799600000001]
aws_lambda_permission.ham_upload_telem: Refreshing state... [id=terraform-20220116222947533100000001]
aws_apigatewayv2_integration.ham_upload_telem: Refreshing state... [id=6b9d42c]
aws_apigatewayv2_integration.ham_get_listener_telemetry: Refreshing state... [id=30jtt73]
aws_lambda_permission.ham_get_listener_telemetry: Refreshing state... [id=terraform-20220410035700871200000001]
aws_cloudwatch_event_target.recovery_ingest: Refreshing state... [id=recovery_ingest-recovery_ingest]
aws_lambda_permission.recovery_ingest: Refreshing state... [id=terraform-20220126062338600800000001]
aws_lambda_permission.history: Refreshing state... [id=terraform-20210215030703150600000002]
aws_apigatewayv2_integration.history: Refreshing state... [id=66le01p]
aws_lambda_permission.get_listener_telemetry: Refreshing state... [id=terraform-20210721094823635000000001]
aws_apigatewayv2_integration.get_listener_telemetry: Refreshing state... [id=ab3t2lo]
aws_apigatewayv2_integration.get_sites: Refreshing state... [id=lhog6mf]
aws_lambda_permission.get_sites: Refreshing state... [id=terraform-20211004105421479600000001]
aws_apigatewayv2_integration.reverse_predictions: Refreshing state... [id=twwzlck]
aws_lambda_permission.reverse_predictions: Refreshing state... [id=terraform-20211009045533567800000001]
aws_apigatewayv2_integration.get_telem: Refreshing state... [id=jimf7df]
aws_lambda_permission.get_telem: Refreshing state... [id=terraform-20210202103643622900000001]
aws_lambda_permission.ham_get: Refreshing state... [id=terraform-20220226234643734200000001]
aws_lambda_permission.get_sondes: Refreshing state... [id=terraform-20210202070651842200000001]
aws_apigatewayv2_integration.get_sondes: Refreshing state... [id=6ukw9c9]
aws_apigatewayv2_integration.ham_get: Refreshing state... [id=n7cjhuk]
aws_cloudfront_distribution.sondehub: Refreshing state... [id=E79DTM5JX0RNU]
aws_lambda_permission.ham_listener_put: Refreshing state... [id=terraform-20220227022754058900000001]
aws_apigatewayv2_integration.ham_listener_put: Refreshing state... [id=ptca7vq]
aws_lambda_permission.upload_telem: Refreshing state... [id=02a8513f-50e7-5938-9f50-d47a208ea9c4]
aws_apigatewayv2_integration.upload_telem: Refreshing state... [id=cnw9e24]
aws_lambda_permission.station: Refreshing state... [id=terraform-20210401090915325300000001]
aws_apigatewayv2_integration.stations: Refreshing state... [id=mwpzl34]
aws_lambda_permission.sns_to_mqtt: Refreshing state... [id=terraform-20211027235710712300000001]
aws_lambda_permission.get_listener_stats: Refreshing state... [id=terraform-20220117001724028500000001]
aws_apigatewayv2_integration.get_listener_stats: Refreshing state... [id=sq58ii1]
aws_lambda_permission.get_listeners_stats: Refreshing state... [id=terraform-20220212073026325900000001]
aws_cloudfront_distribution.testing: Refreshing state... [id=E1899XF5PNG0C7]
aws_apigatewayv2_domain_name.ApiGatewayV2DomainName: Refreshing state... [id=api-raw.v2.sondehub.org]
aws_lb_listener.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener/app/ws/d29968044c69f0da/320139c9e787f8ac]
aws_cognito_user_pool_domain.main: Refreshing state... [id=auth.v2.sondehub.org]
aws_lambda_permission.predictions: Refreshing state... [id=terraform-20210222053152988200000001]
aws_apigatewayv2_integration.predictions: Refreshing state... [id=qsw8rmd]
aws_apigatewayv2_route.ham_predictions: Refreshing state... [id=a2vdjm3]
aws_apigatewayv2_route.sign_socket: Refreshing state... [id=q5dgv70]
aws_apigatewayv2_route.ham_telem: Refreshing state... [id=xhkgm6t]
aws_route53_record.es: Refreshing state... [id=Z0571575V2EX2P3LK16U_es_CNAME]
aws_apigatewayv2_route.ham_get_listener_telemetry: Refreshing state... [id=rhsyczp]
aws_apigatewayv2_route.ham_upload_telem: Refreshing state... [id=gkhgene]
aws_apigatewayv2_route.history: Refreshing state... [id=wytcqsn]
aws_apigatewayv2_route.get_listener_telemetry: Refreshing state... [id=wcyj71b]
aws_apigatewayv2_route.reverse_predictions: Refreshing state... [id=r9jwvbm]
aws_apigatewayv2_route.get_sites: Refreshing state... [id=pzuni2l]
aws_iam_role_policy.IAMPolicy2: Refreshing state... [id=Cognito_sondesUnauth_Role:oneClick_Cognito_sondesUnauth_Role_1611905520139]
aws_apigatewayv2_route.get_telem: Refreshing state... [id=6y7jyfq]
aws_apigatewayv2_route.get_sondes: Refreshing state... [id=6eghzch]
aws_apigatewayv2_route.ham_get: Refreshing state... [id=v90ren0]
aws_apigatewayv2_route.ham_listener_put: Refreshing state... [id=1f13y15]
aws_iam_role_policy.IAMPolicy: Refreshing state... [id=Cognito_sondesAuth_Role:sondes-v2]
aws_cognito_identity_pool_roles_attachment.CognitoIdentityPoolRoleAttachment: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_iam_role_policy.IAMPolicy3: Refreshing state... [id=Cognito_sondesAuth_Role:oneClick_Cognito_sondesAuth_Role_1611905520138]
aws_route53_record.tracker_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_AAAA]
aws_route53_record.v2_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U__AAAA]
aws_route53_record.www_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_AAAA]
aws_route53_record.tracker_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_A]
aws_route53_record.root_A: Refreshing state... [id=Z0756308IVLVF48G6G1S__A]
aws_route53_record.root_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S__AAAA]
aws_route53_record.v2_A: Refreshing state... [id=Z0571575V2EX2P3LK16U__A]
aws_route53_record.www_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_A]
aws_route53_record.auth["A"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_A]
aws_route53_record.auth["AAAA"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_AAAA]
aws_apigatewayv2_route.upload_telem: Refreshing state... [id=ps2g60b]
aws_apigatewayv2_route.stations: Refreshing state... [id=mdkjsnl]
aws_lb_listener_rule.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener-rule/app/ws/d29968044c69f0da/320139c9e787f8ac/43f26c3ee3077d14]
aws_apigatewayv2_route.get_listeners_stats: Refreshing state... [id=bpw78c5]
aws_apigatewayv2_route.get_listener_stats: Refreshing state... [id=mrs76au]
aws_route53_record.testing_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_A]
aws_apigatewayv2_api_mapping.ApiGatewayV2ApiMapping: Refreshing state... [id=lkd9wl]
aws_route53_record.testing_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_AAAA]
aws_route53_record.api_raw: Refreshing state... [id=Z0571575V2EX2P3LK16U_api-raw_CNAME]
aws_cloudfront_distribution.api: Refreshing state... [id=E3KEBAPY1913GO]
aws_apigatewayv2_route.predictions: Refreshing state... [id=s9z3t7t]
aws_lambda_function.recovered_put: Refreshing state... [id=recovered_put]
aws_lambda_function.historic_to_s3: Refreshing state... [id=historic_to_s3]
aws_lambda_function.ham_sqs_to_elk: Refreshing state... [id=ham-sqs-to-elk]
aws_lambda_function.recovered_stats: Refreshing state... [id=recovered_stats]
aws_lambda_function.recovered_get: Refreshing state... [id=recovered_get]
aws_lambda_function.queue_data_update: Refreshing state... [id=queue_data_update]
aws_lambda_function.predict_updater: Refreshing state... [id=predict_updater]
aws_lambda_function.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_lambda_function.ham_predict_updater: Refreshing state... [id=ham_predict_updater]
aws_route53_record.api_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_AAAA]
aws_route53_record.api_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_A]
aws_cloudwatch_event_target.ham_predict_updater: Refreshing state... [id=ham_predict_updater-SendToLambda]
aws_lambda_permission.ham_predict_updater: Refreshing state... [id=terraform-20220409025447509800000001]
aws_lambda_event_source_mapping.ham_sqs_to_elk: Refreshing state... [id=df4d2334-34e3-4cda-bb38-83d0d10d7dcf]
aws_lambda_permission.recovered_put: Refreshing state... [id=terraform-20210606010536710300000001]
aws_apigatewayv2_integration.recovered_put: Refreshing state... [id=hdkf78r]
aws_lambda_permission.recovered_stats: Refreshing state... [id=terraform-20211220010615406300000001]
aws_apigatewayv2_integration.recovered_stats: Refreshing state... [id=ss8ukvb]
aws_lambda_event_source_mapping.historic_to_s3: Refreshing state... [id=5bb8546b-2e64-4bf2-aae1-b94c6337e4e8]
aws_lambda_permission.history_cron: Refreshing state... [id=terraform-20210802123205008600000001]
aws_cloudwatch_event_target.sns: Refreshing state... [id=history_queue-SendToLambda]
aws_lambda_permission.recovered_get: Refreshing state... [id=terraform-20210606010548494800000002]
aws_apigatewayv2_integration.recovered_get: Refreshing state... [id=8xxwvem]
aws_apigatewayv2_route.recovered_put: Refreshing state... [id=e88oqzm]
aws_lambda_event_source_mapping.sqs_to_elk: Refreshing state... [id=33b4ab9d-4977-43e7-a994-dc90290ff9b9]
aws_apigatewayv2_route.recovered_stats: Refreshing state... [id=ad6q4bt]
aws_lambda_permission.predict_updater: Refreshing state... [id=terraform-20210913041550353600000001]
aws_cloudwatch_event_target.predict_updater: Refreshing state... [id=predict_updater-SendToLambda]
aws_apigatewayv2_route.recovered_get: Refreshing state... [id=eysilfn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_acm_certificate.CertificateManagerCertificate has changed
  ~ resource "aws_acm_certificate" "CertificateManagerCertificate" {
        id                        = "arn:aws:acm:us-east-1:143841941773:certificate/e2187cc3-6098-4ac9-917e-acd414bdb75e"
      ~ subject_alternative_names = [
          + "v2.sondehub.org",
            # (1 unchanged element hidden)
        ]
        tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.CertificateManagerCertificate_root has changed
  ~ resource "aws_acm_certificate" "CertificateManagerCertificate_root" {
        id                        = "arn:aws:acm:us-east-1:143841941773:certificate/a7da821c-bdbc-404b-aa12-bce28d86cdeb"
      ~ subject_alternative_names = [
          + "v2.sondehub.org",
            # (3 unchanged elements hidden)
        ]
        tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_domain_name.ApiGatewayV2DomainName has changed
  ~ resource "aws_apigatewayv2_domain_name" "ApiGatewayV2DomainName" {
        id                               = "api-raw.v2.sondehub.org"
        tags                             = {}
        # (4 unchanged attributes hidden)

      ~ domain_name_configuration {
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_cognito_user_pool.CognitoUserPool has changed
  ~ resource "aws_cognito_user_pool" "CognitoUserPool" {
      ~ estimated_number_of_users  = 77 -> 79
        id                         = "us-east-1_G4H7NMniM"
        name                       = "sondes"
        tags                       = {}
        # (14 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_elasticsearch_domain.ElasticsearchDomain has changed
  ~ resource "aws_elasticsearch_domain" "ElasticsearchDomain" {
        id                    = "arn:aws:es:us-east-1:143841941773:domain/sondes-v2-7-9"
        tags                  = {}
        # (9 unchanged attributes hidden)



      ~ cluster_config {
            # (7 unchanged attributes hidden)

          + cold_storage_options {
              + enabled = false
            }
        }







        # (11 unchanged blocks hidden)
    }

  # aws_lambda_function.get_listener_stats has changed
  ~ resource "aws_lambda_function" "get_listener_stats" {
        id                             = "get_listener_stats"
        tags                           = {
            "Name" = "get_listener_stats"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.get_listener_telemetry has changed
  ~ resource "aws_lambda_function" "get_listener_telemetry" {
        id                             = "get_listener_telemetry"
        tags                           = {
            "Name" = "get_listener_telemetry"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sites has changed
  ~ resource "aws_lambda_function" "get_sites" {
        id                             = "get_sites"
        tags                           = {
            "Name" = "get_sites"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sondes has changed
  ~ resource "aws_lambda_function" "get_sondes" {
        id                             = "query"
        tags                           = {
            "Name" = "query"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.get_telem has changed
  ~ resource "aws_lambda_function" "get_telem" {
        id                             = "get_telem"
        tags                           = {
            "Name" = "get_telem"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get has changed
  ~ resource "aws_lambda_function" "ham_get" {
        id                             = "ham_get"
        tags                           = {
            "Name" = "ham_get"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get_listener_telemetry has changed
  ~ resource "aws_lambda_function" "ham_get_listener_telemetry" {
        id                             = "ham_get_listener_telemetry"
        tags                           = {
            "Name" = "ham_get_listener_telemetry"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_listener_put has changed
  ~ resource "aws_lambda_function" "ham_listener_put" {
        id                             = "ham-listener-put"
        tags                           = {
            "Name" = "ham-listener-put"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predict_updater has changed
  ~ resource "aws_lambda_function" "ham_predict_updater" {
        id                             = "ham_predict_updater"
        tags                           = {
            "Name" = "ham_predict_updater"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predictions has changed
  ~ resource "aws_lambda_function" "ham_predictions" {
        id                             = "ham_predictions"
        tags                           = {
            "Name" = "ham_predictions"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sns_to_mqtt has changed
  ~ resource "aws_lambda_function" "ham_sns_to_mqtt" {
        id                             = "ham-sns-to-mqtt"
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }


        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sqs_to_elk has changed
  ~ resource "aws_lambda_function" "ham_sqs_to_elk" {
        id                             = "ham-sqs-to-elk"
        tags                           = {
            "Name" = "ham_sqs_to_elk"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_telem has changed
  ~ resource "aws_lambda_function" "ham_telem" {
        id                             = "ham_get_telem"
        tags                           = {
            "Name" = "ham_get_telem"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_upload_telem has changed
  ~ resource "aws_lambda_function" "ham_upload_telem" {
        id                             = "ham-put-api"
        tags                           = {}
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.historic_to_s3 has changed
  ~ resource "aws_lambda_function" "historic_to_s3" {
        id                             = "historic_to_s3"
        tags                           = {
            "Name" = "historic_to_s3"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.history has changed
  ~ resource "aws_lambda_function" "history" {
        id                             = "history"
        tags                           = {
            "Name" = "history"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.predict_updater has changed
  ~ resource "aws_lambda_function" "predict_updater" {
        id                             = "predict_updater"
        tags                           = {
            "Name" = "predict_updater"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.predictions has changed
  ~ resource "aws_lambda_function" "predictions" {
        id                             = "predictions"
        tags                           = {
            "Name" = "predictions"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.predictor_update_trigger_lambda has changed
  ~ resource "aws_lambda_function" "predictor_update_trigger_lambda" {
        id                             = "tawhiri-updater"
        tags                           = {
            "Name" = "tawhiri-updater"
        }
        # (21 unchanged attributes hidden)

      + ephemeral_storage {
          + size = 512
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.queue_data_update has changed
  ~ resource "aws_lambda_function" "queue_data_update" {
        id                             = "queue_data_update"
        tags                           = {
            "Name" = "queue_data_update"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_get has changed
  ~ resource "aws_lambda_function" "recovered_get" {
        id                             = "recovered_get"
        tags                           = {
            "Name" = "recovered_get"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_put has changed
  ~ resource "aws_lambda_function" "recovered_put" {
        id                             = "recovered_put"
        tags                           = {
            "Name" = "recovered_put"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_stats has changed
  ~ resource "aws_lambda_function" "recovered_stats" {
        id                             = "recovered_stats"
        tags                           = {
            "Name" = "recovered_stats"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.recovery_ingest has changed
  ~ resource "aws_lambda_function" "recovery_ingest" {
        id                             = "recovery_ingest"
        tags                           = {
            "Name" = "recovered_get"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.redirect has changed
  ~ resource "aws_lambda_function" "redirect" {
        id                             = "sondehub-redirect"
        tags                           = {}
        # (21 unchanged attributes hidden)

      + ephemeral_storage {
          + size = 512
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reverse_predictions has changed
  ~ resource "aws_lambda_function" "reverse_predictions" {
        id                             = "reverse-predictions"
        tags                           = {
            "Name" = "reverse_predictions"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.sign_socket has changed
  ~ resource "aws_lambda_function" "sign_socket" {
        id                             = "sign-websocket"
        tags                           = {}
        # (21 unchanged attributes hidden)

      + ephemeral_storage {
          + size = 512
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.sns_to_mqtt has changed
  ~ resource "aws_lambda_function" "sns_to_mqtt" {
        id                             = "sns-to-mqtt"
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }



        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.sqs_to_elk has changed
  ~ resource "aws_lambda_function" "sqs_to_elk" {
        id                             = "sqs-to-elk"
        tags                           = {
            "Name" = "sqs_to_elk"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }


        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.station has changed
  ~ resource "aws_lambda_function" "station" {
        id                             = "station-api-to-iot-core"
        tags                           = {
            "Name" = "station-api-to-iot-core"
        }
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_telem has changed
  ~ resource "aws_lambda_function" "upload_telem" {
        id                             = "sonde-api-to-iot-core"
        tags                           = {}
        # (21 unchanged attributes hidden)


      + ephemeral_storage {
          + size = 512
        }


        # (3 unchanged blocks hidden)
    }

  # aws_network_interface.ws_pad[0] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-0da878f06d90dcde9"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.4",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[1] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-0d808bd7acad70c66"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.5",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[2] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-0ddc45ce32abb4a58"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.6",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[3] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-0d40407d608d35e38"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.7",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[4] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-01e4afb86960a27cf"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.8",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[5] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-0776494ae4f908042"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.9",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[6] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-069ebf56c9e4fdd7f"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.10",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[7] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-054a9210306259e1b"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.12",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_network_interface.ws_pad[8] has changed
  ~ resource "aws_network_interface" "ws_pad" {
        id                 = "eni-07c92d00c031482ec"
      + ipv6_address_list  = []
      + private_ip_list    = [
          + "172.31.134.14",
        ]
        tags               = {}
        # (19 unchanged attributes hidden)
    }

  # aws_route.main has changed
  ~ resource "aws_route" "main" {
        id                     = "r-rtb-0efda81da4e7baf2b1080289494"
        # (5 unchanged attributes hidden)
    }

  # aws_route.main6 has changed
  ~ resource "aws_route" "main6" {
        id                          = "r-rtb-0efda81da4e7baf2b2750132062"
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.main has changed
  ~ resource "aws_route_table" "main" {
        id               = "rtb-0efda81da4e7baf2b"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = "eigw-07166246a33f04b24"
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = ""
              - core_network_arn           = null
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = "eigw-07166246a33f04b24"
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = "::/0"
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-b5988cce"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = null
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-b5988cce"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "172.26.0.0/16"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-0ef66c63e23e3df56"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "172.26.0.0/16"
              - core_network_arn           = null
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0ef66c63e23e3df56"
            },
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.card has changed
  ~ resource "aws_s3_bucket" "card" {
        id                          = "sondehub-v2-card"
      + object_lock_enabled         = false
        tags                        = {}
        # (10 unchanged attributes hidden)

      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.cf_logs has changed
  ~ resource "aws_s3_bucket" "cf_logs" {
        id                          = "sondehub-cloudfront-logs"
      + object_lock_enabled         = false
        tags                        = {}
        # (10 unchanged attributes hidden)

      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.history has changed
  ~ resource "aws_s3_bucket" "history" {
        id                          = "sondehub-history"
      + object_lock_enabled         = false
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "s3:GetObjectTorrent",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::sondehub-history/*",
                          + "arn:aws:s3:::sondehub-history",
                        ]
                      + Sid       = "PublicRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        tags                        = {}
        # (12 unchanged attributes hidden)


      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }


        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.lambda_functions has changed
  ~ resource "aws_s3_bucket" "lambda_functions" {
        id                          = "terraform-20211220081940015700000001"
      + object_lock_enabled         = false
        tags                        = {}
        # (10 unchanged attributes hidden)

      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.predict has changed
  ~ resource "aws_s3_bucket" "predict" {
        id                          = "sondehub-predict"
      + object_lock_enabled         = false
        tags                        = {}
        # (10 unchanged attributes hidden)

      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.v2 has changed
  ~ resource "aws_s3_bucket" "v2" {
        id                          = "v2.sondehub.org"
      + object_lock_enabled         = false
      + policy                      = jsonencode(
            {
              + Id        = "Policy1615627853229"
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::v2.sondehub.org/*"
                      + Sid       = "Stmt1615627852247"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        tags                        = {}
        # (10 unchanged attributes hidden)

      + grant {
          + id          = "0c5a9489b8bd8308a9ceed8a279885e5cbcbcb8be6ec9d2fe16ded7ac7d522a2"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

        # (1 unchanged block hidden)
    }

  # aws_vpc.main has changed
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-0a0baa77"
      + ipv6_cidr_block_network_border_group = "us-east-1"
        tags                                 = {}
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.get_listener_stats will be updated in-place
  ~ resource "aws_lambda_function" "get_listener_stats" {
        id                             = "get_listener_stats"
      ~ last_modified                  = "2022-04-26T09:40:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_listener_stats:38" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "get_listener_stats"
        }
      ~ version                        = "38" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_listener_telemetry will be updated in-place
  ~ resource "aws_lambda_function" "get_listener_telemetry" {
        id                             = "get_listener_telemetry"
      ~ last_modified                  = "2022-04-26T09:40:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_listener_telemetry:75" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "get_listener_telemetry"
        }
      ~ version                        = "75" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sites will be updated in-place
  ~ resource "aws_lambda_function" "get_sites" {
        id                             = "get_sites"
      ~ last_modified                  = "2022-04-26T09:44:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_sites:67" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "get_sites"
        }
      ~ version                        = "67" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sondes will be updated in-place
  ~ resource "aws_lambda_function" "get_sondes" {
        id                             = "query"
      ~ last_modified                  = "2022-04-26T09:40:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:query:120" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "query"
        }
      ~ version                        = "120" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_telem will be updated in-place
  ~ resource "aws_lambda_function" "get_telem" {
        id                             = "get_telem"
      ~ last_modified                  = "2022-04-26T09:44:20.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_telem:130" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "get_telem"
        }
      ~ version                        = "130" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get will be updated in-place
  ~ resource "aws_lambda_function" "ham_get" {
        id                             = "ham_get"
      ~ last_modified                  = "2022-04-26T09:40:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get:25" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_get"
        }
      ~ version                        = "25" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get_listener_telemetry will be updated in-place
  ~ resource "aws_lambda_function" "ham_get_listener_telemetry" {
        id                             = "ham_get_listener_telemetry"
      ~ last_modified                  = "2022-04-26T09:42:19.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get_listener_telemetry:6" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_get_listener_telemetry"
        }
      ~ version                        = "6" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_listener_put will be updated in-place
  ~ resource "aws_lambda_function" "ham_listener_put" {
        id                             = "ham-listener-put"
      ~ last_modified                  = "2022-04-26T09:44:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-listener-put:21" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham-listener-put"
        }
      ~ version                        = "21" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predict_updater will be updated in-place
  ~ resource "aws_lambda_function" "ham_predict_updater" {
        id                             = "ham_predict_updater"
      ~ last_modified                  = "2022-04-26T09:43:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_predict_updater:8" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_predict_updater"
        }
      ~ version                        = "8" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predictions will be updated in-place
  ~ resource "aws_lambda_function" "ham_predictions" {
        id                             = "ham_predictions"
      ~ last_modified                  = "2022-04-26T09:42:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_predictions:8" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_predictions"
        }
      ~ version                        = "8" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sns_to_mqtt will be updated in-place
  ~ resource "aws_lambda_function" "ham_sns_to_mqtt" {
        id                             = "ham-sns-to-mqtt"
      ~ last_modified                  = "2022-04-26T09:41:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sns-to-mqtt:42" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "42" -> (known after apply)
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sqs_to_elk will be updated in-place
  ~ resource "aws_lambda_function" "ham_sqs_to_elk" {
        id                             = "ham-sqs-to-elk"
      ~ last_modified                  = "2022-04-26T09:40:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sqs-to-elk:46" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_sqs_to_elk"
        }
      ~ version                        = "46" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_telem" {
        id                             = "ham_get_telem"
      ~ last_modified                  = "2022-04-26T09:40:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get_telem:25" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "ham_get_telem"
        }
      ~ version                        = "25" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_upload_telem" {
        id                             = "ham-put-api"
      ~ last_modified                  = "2022-04-26T09:43:57.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-put-api:44" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.historic_to_s3 will be updated in-place
  ~ resource "aws_lambda_function" "historic_to_s3" {
        id                             = "historic_to_s3"
      ~ last_modified                  = "2022-04-26T09:40:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:historic_to_s3:81" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "historic_to_s3"
        }
      ~ version                        = "81" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.history will be updated in-place
  ~ resource "aws_lambda_function" "history" {
        id                             = "history"
      ~ last_modified                  = "2022-04-26T09:42:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:history:78" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "history"
        }
      ~ version                        = "78" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predict_updater will be updated in-place
  ~ resource "aws_lambda_function" "predict_updater" {
        id                             = "predict_updater"
      ~ last_modified                  = "2022-04-26T09:41:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:predict_updater:77" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "predict_updater"
        }
      ~ version                        = "77" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predictions will be updated in-place
  ~ resource "aws_lambda_function" "predictions" {
        id                             = "predictions"
      ~ last_modified                  = "2022-04-26T09:42:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:predictions:103" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "predictions"
        }
      ~ version                        = "103" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predictor_update_trigger_lambda will be updated in-place
  ~ resource "aws_lambda_function" "predictor_update_trigger_lambda" {
        id                             = "tawhiri-updater"
      ~ last_modified                  = "2022-04-26T09:42:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:tawhiri-updater:64" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "tawhiri-updater"
        }
      ~ version                        = "64" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.queue_data_update will be updated in-place
  ~ resource "aws_lambda_function" "queue_data_update" {
        id                             = "queue_data_update"
      ~ last_modified                  = "2022-04-26T09:42:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:queue_data_update:69" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "queue_data_update"
        }
      ~ version                        = "69" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_get will be updated in-place
  ~ resource "aws_lambda_function" "recovered_get" {
        id                             = "recovered_get"
      ~ last_modified                  = "2022-04-26T09:43:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_get:71" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "recovered_get"
        }
      ~ version                        = "71" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_put will be updated in-place
  ~ resource "aws_lambda_function" "recovered_put" {
        id                             = "recovered_put"
      ~ last_modified                  = "2022-04-26T09:44:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_put:71" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "recovered_put"
        }
      ~ version                        = "71" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_stats will be updated in-place
  ~ resource "aws_lambda_function" "recovered_stats" {
        id                             = "recovered_stats"
      ~ last_modified                  = "2022-04-26T09:44:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_stats:61" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "recovered_stats"
        }
      ~ version                        = "61" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovery_ingest will be updated in-place
  ~ resource "aws_lambda_function" "recovery_ingest" {
        id                             = "recovery_ingest"
      ~ last_modified                  = "2022-04-26T09:42:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovery_ingest:37" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "recovered_get"
        }
      ~ version                        = "37" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reverse_predictions will be updated in-place
  ~ resource "aws_lambda_function" "reverse_predictions" {
        id                             = "reverse-predictions"
      ~ last_modified                  = "2022-04-26T09:40:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:reverse-predictions:65" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "reverse_predictions"
        }
      ~ version                        = "65" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.sign_socket will be updated in-place
  ~ resource "aws_lambda_function" "sign_socket" {
        id                             = "sign-websocket"
      ~ last_modified                  = "2022-04-26T09:43:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sign-websocket:65" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {}
      ~ version                        = "65" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.sns_to_mqtt will be updated in-place
  ~ resource "aws_lambda_function" "sns_to_mqtt" {
        id                             = "sns-to-mqtt"
      ~ last_modified                  = "2022-04-26T09:44:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sns-to-mqtt:43" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "43" -> (known after apply)
        # (17 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.sqs_to_elk will be updated in-place
  ~ resource "aws_lambda_function" "sqs_to_elk" {
        id                             = "sqs-to-elk"
      ~ last_modified                  = "2022-04-26T09:44:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sqs-to-elk:77" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "sqs_to_elk"
        }
      ~ version                        = "77" -> (known after apply)
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.station will be updated in-place
  ~ resource "aws_lambda_function" "station" {
        id                             = "station-api-to-iot-core"
      ~ last_modified                  = "2022-04-26T09:40:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:station-api-to-iot-core:75" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {
            "Name" = "station-api-to-iot-core"
        }
      ~ version                        = "75" -> (known after apply)
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "upload_telem" {
        id                             = "sonde-api-to-iot-core"
      ~ last_modified                  = "2022-04-26T09:41:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sonde-api-to-iot-core:121" -> (known after apply)
      ~ source_code_hash               = "E1pOeHjoNCZbv/Don+He7/CZtWoCybKBjVJnSsuVTKo=" -> "RPdGmFSC0WWcfdnhIXRA+2IfIjgastpI6TZ0LHqHBdo="
        tags                           = {}
      ~ version                        = "121" -> (known after apply)
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.lambda will be updated in-place
  ~ resource "aws_s3_bucket_object" "lambda" {
      ~ etag               = "cc2088bc5d015f31f6620530eaffd796" -> "026507e7d53f4794a7b17fddf15a84b6"
        id                 = "lambda.zip"
        tags               = {}
      ~ version_id         = "7HO0hOKlDs4sM4ZHikLaSNon_XNU9P46" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 31 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.history,
  on cdn.tf line 718, in resource "aws_s3_bucket" "history":
 718: resource "aws_s3_bucket" "history" {

Use the aws_s3_bucket_cors_configuration resource instead

(and 13 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: prod.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "prod.plan"

```

</details>

*Pusher: @TheSkorm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*